# IsSchematic Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisConstruction..::..IsSchematic Property
EnergyAnalysisConstruction Class See Also
---
Indicates if this originates from a schematic or analytical construction.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public bool IsSchematic { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsSchematic As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsSchematic {
	bool get ();
}
```

# See Also
EnergyAnalysisConstruction Class
Autodesk.Revit.DB.Analysis Namespace